In [4]:
import pandas as pd
import numpy as np

## **Series**

In [2]:
labels = ["a", "b", "c"]
data = [1,2,3]
pd.Series(data=data, index=labels)

a    1
b    2
c    3
dtype: int64

In [11]:
array = np.arange(5,8)
label = ["Item 01", "Item 02", "Item 03"]
serie_01 = pd.Series(array, label)
serie_01

Item 01    5
Item 02    6
Item 03    7
dtype: int64

In [10]:
serie_01["Item 01"]

5

In [12]:
serie_01[1]

6

In [15]:
serie_02 = pd.Series([1200, 300, 456, 852, 6], ["Audi", "Toyota", "Nissan", "Kia", "Ferrari"])
serie_03 = pd.Series([236, 789, 1300, 789], ["Audi", "Toyota", "Nissan", "Kia"])

car_sales = serie_02 + serie_03
car_sales

Audi       1436.0
Ferrari       NaN
Kia        1641.0
Nissan     1756.0
Toyota     1089.0
dtype: float64

## **Dataframes**

In [16]:
rows = ["Lexus", "Infinity", "Ferrari", "Tesla"]
columns = ["San Carlos", "New York", "London", "San Francisco"]
data = [[456,569,785,780], [4,895,123,102], [302,1020,895,6], [145,588,1360,458]]

dataframe = pd.DataFrame(data, rows, columns)
dataframe

          San Carlos  New York  London  San Francisco
Lexus            456       569     785            780
Infinity           4       895     123            102
Ferrari          302      1020     895              6
Tesla            145       588    1360            458

In [17]:
dataframe.loc['Lexus'] # Select a row

San Carlos       456
New York         569
London           785
San Francisco    780
Name: Lexus, dtype: int64

In [18]:
dataframe.loc[['Lexus', 'Tesla']] # Select multiple rows

       San Carlos  New York  London  San Francisco
Lexus         456       569     785            780
Tesla         145       588    1360            458

In [19]:
dataframe["San Carlos"] # Select a column

Lexus       456
Infinity      4
Ferrari     302
Tesla       145
Name: San Carlos, dtype: int64

In [20]:
dataframe[["San Carlos", "London"]] # Select multiple columns

          San Carlos  London
Lexus            456     785
Infinity           4     123
Ferrari          302     895
Tesla            145    1360

In [21]:
dataframe["San Carlos"]["Ferrari"] # Specific Value

302

In [23]:
# add new column
dataframe["Total"] = dataframe["San Carlos"] + dataframe["New York"] + dataframe["London"] + dataframe["San Francisco"]
dataframe

          San Carlos  New York  London  San Francisco  Total
Lexus            456       569     785            780   2590
Infinity           4       895     123            102   1124
Ferrari          302      1020     895              6   2223
Tesla            145       588    1360            458   2551

In [24]:
# Drops a column from view, but not permanently
dataframe.drop("Total", axis=1) #axis=1 significa que es una columna

          San Carlos  New York  London  San Francisco
Lexus            456       569     785            780
Infinity           4       895     123            102
Ferrari          302      1020     895              6
Tesla            145       588    1360            458

In [25]:
# Drops a column from permanently
dataframe.drop("Total", axis=1, inplace=True)
dataframe

          San Carlos  New York  London  San Francisco
Lexus            456       569     785            780
Infinity           4       895     123            102
Ferrari          302      1020     895              6
Tesla            145       588    1360            458

In [27]:
dataframe.shape

(4, 4)

## **Select Data**

In [ ]:
rows = "".split()
columns = ["San Carlos", "New York", "London", "San Francisco"]
data = [[456,569,785,780], [4,895,123,102], [302,1020,895,6], [145,588,1360,458]]

dataframe = pd.DataFrame(data, rows, columns)
dataframe